<a href="https://colab.research.google.com/github/kvnmnnng/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/DSPT6_U1_Mod3_Join_Reshape_datasets_Kevin_Manning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [2]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-03-18 01:34:07--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.20.101
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.20.101|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  47.8MB/s    in 4.5s

2020-03-18 01:34:12 (43.3 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [3]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
##### YOUR CODE HERE #####
import matplotlib.pyplot as plt
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [0]:
# look at various datasets to find data that we need
# aisles --> no
# departments --> no
# order products prior (train/test) --> maybe
# orders --> yes
# products --> yes

In [7]:
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [8]:

# And products? We need 'product_name' and 'product_id'
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [9]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [0]:
# to me, it looks like we need the order_id, product_id and the product_name
# filter for the 10 most popular items

# 1. find out the product ids for 10 most popular items
# 2. with the product ids, find the number of orders for each item

products = pd.read_csv('products.csv')

order_products = pd.concat([pd.read_csv('order_products__prior.csv'), 
                            pd.read_csv('order_products__train.csv')])

orders = pd.read_csv('orders.csv')

In [0]:
# These are the top 10 most frequently ordered products. How many times was each ordered?
#Banana
#Bag of Organic Bananas
#Organic Strawberries
#Organic Baby Spinach
#Organic Hass Avocado
#Organic Avocado
#Large Lemon
#Strawberries
#Limes
# Organic Whole Milk


product_name = ['Banana', 'Bag of Organic Bananas', 'Organic Strawberries',
                'Organic Strawberries', 'Organic Baby Spinach',
                 'Organic Hass Avocado', 'Organic Avocado',
                 'Large Lemon', 'Strawberries', 'Limes',
                 'Organic Whole Milk']

In [30]:
condition1 = products['product_name'].isin(product_names)
print(products.shape)
products= products[condition1]
print(products.shape)
products

(49688, 4)
(10, 4)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [0]:
# order products has the product_id in it
# merge that to the filtered products with common product_id
# merging the two will lead to results of 
# how many times 10 most popular products 
# were ordered

In [34]:
most_popular = (products[['product_name', 'product_id']]
                .merge(order_products[['order_id', 'product_id']]))
print(most_popular.shape)
most_popular.head()

(2418314, 3)

             product_name  product_id  order_id
0  Bag of Organic Bananas       13176         5
1  Bag of Organic Bananas       13176        27
2  Bag of Organic Bananas       13176        29
3  Bag of Organic Bananas       13176        32
4  Bag of Organic Bananas       13176        42

In [40]:
# just checking
most_popular.tail()

            product_name  product_id  order_id
2418309  Organic Avocado       47766   3419827
2418310  Organic Avocado       47766   3420232
2418311  Organic Avocado       47766   3420257
2418312  Organic Avocado       47766   3420578
2418313  Organic Avocado       47766   3420857

In [42]:
# this should be the answer to how many times
# the 10 most-popular items were ordered
# normalize = False to give number, not per cents

most_popular['product_name'].value_counts(normalize= False)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [55]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [56]:
# Table 2 --> Tidy
# table2 -> tidy
# grab column names as list
table2.columns.to_list()

['John Smith', 'Jane Doe', 'Mary Johnson']

In [57]:
# grab the index values as another list
table2.index.to_list()

['treatmenta', 'treatmentb']

In [58]:
# convert the index to a new column
table2 = table2.reset_index(drop = False)
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [59]:
# convert the table using melt method
# to go from wide to tidy

tidy2 = table2.melt(id_vars= 'index',
                    value_vars = ['John Smith', 'Jane Doe', 'Mary Johnson'])
tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [60]:
# rename the columns
tidy2 = tidy2.rename(columns = {
    'index': 'trtmnt',
    'variable': 'name',
    'value' : 'result'})
tidy2

       trtmnt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [62]:
# clean up the treatment column

tidy2['trtmnt'] = tidy2['trtmnt'].str.replace('treatment', '')
tidy2

# would like to know how to center the column header and/or the column entries?
# I know, 'let me google that for you'.com

  trtmnt          name  result
0      a    John Smith     NaN
1      b    John Smith     2.0
2      a      Jane Doe    16.0
3      b      Jane Doe    11.0
4      a  Mary Johnson     3.0
5      b  Mary Johnson     1.0

In [63]:
# Tidy --> Table 2
tidy2

  trtmnt          name  result
0      a    John Smith     NaN
1      b    John Smith     2.0
2      a      Jane Doe    16.0
3      b      Jane Doe    11.0
4      a  Mary Johnson     3.0
5      b  Mary Johnson     1.0

In [68]:
# pivot table is the reverse of melt

wide2 = tidy2.pivot_table(index = 'trtmnt',
                          columns = 'name',
                          values = 'result')

wide2

name    Jane Doe  John Smith  Mary Johnson
trtmnt
a           16.0         NaN           3.0
b           11.0         2.0           1.0

In [0]:
# break!

In [0]:
# Load seaborn's flights dataset by running the cell below.
# Then create a pivot table showing the number of passengers by month and year.
# Use year for the index and month for the columns. 
# You've done it right if you get 112 passengers for January 1949
# and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [72]:
# convert it to my dataframe
# sample the data
flights_df = flights
flights_df.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [74]:
# sample the data
flights_df.columns

Index(['year', 'month', 'passengers'], dtype='object')

In [75]:
# sample the data
flights.sample(11)

     year      month  passengers
102  1957       July         465
143  1960   December         432
84   1956    January         284
41   1952       June         218
114  1958       July         491
71   1954   December         229
70   1954   November         203
137  1960       June         535
75   1955      April         269
130  1959   November         362
68   1954  September         259

In [0]:
# Then create a pivot table showing the number of passengers by month and year.
# Flights Pivot Table

In [77]:
pivot1 = flights_df.pivot_table(index = 'year',
                                columns = 'month',
                                values = 'passengers')
pivot1

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

In [0]:
# that's it? That seemed too easy!
# I thought there would be more to do
# I guess that's it!
# I will work on the stretch goals, now

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####